In [1]:
import numpy as np
import pandas as pd

# Merging Data

In [8]:
# Data set for merging
student_data = {
    "ID": [101, 102, 103, 104, 105, 106, 107, 108],
    "Name": ["Amit", "Neha", "Ravi", "Pooja", "Kiran", "Sneha", "Arjun", "Meena"],
    "Branch": ["AI", "DS", "AI", "CS", "DS", "CS", "AI", "DS"],
    "Semester": [1, 1, 2, 2, 1, 2, 1, 2],
    "Marks": [78, 85, np.nan, 92, 66, 88, 74, np.nan],
    "Attendance (%)": [90, 95, 88, 98, 75, 92, np.nan, 85]
}
df1 = pd.DataFrame(student_data)

sales_data = {
    "ID": [201, 202, 203, 204, 205, 206, 207, 208],
    "Product": ["Laptop", "Mouse", "Keyboard", "Laptop", "Monitor", "Mouse", "Laptop", "Keyboard"],
    "Category": ["Electronics", "Accessories", "Accessories", "Electronics", "Electronics", "Accessories", "Electronics", "Accessories"],
    "Quantity": [1, 2, 1, 1, 2, 3, 1, 2],
    "Price": [65000, 800, 1500, 70000, 12000, 850, 68000, 1600],
    "Discount (%)": [10, 5, 0, 15, np.nan, 5, 10, 0]
}
df2 = pd.DataFrame(sales_data)

In [9]:
pd.merge(df1,df2,on='ID',how='inner')

Empty DataFrame
Columns: [ID, Name, Branch, Semester, Marks, Attendance (%), Product, Category, Quantity, Price, Discount (%)]
Index: []

In [13]:
pd.merge(df1,df2,on='ID',how='outer')

,ID,Name,Branch,Semester,Marks,Attendance (%),Product,Category,Quantity,Price,Discount (%)
0,101,Amit,AI,1.0,78.0,90.0,NaN,NaN,NaN,NaN,NaN
1,102,Neha,DS,1.0,85.0,95.0,NaN,NaN,NaN,NaN,NaN
2,103,Ravi,AI,2.0,NaN,88.0,NaN,NaN,NaN,NaN,NaN
3,104,Pooja,CS,2.0,92.0,98.0,NaN,NaN,NaN,NaN,NaN
4,105,Kiran,DS,1.0,66.0,75.0,NaN,NaN,NaN,NaN,NaN
5,106,Sneha,CS,2.0,88.0,92.0,NaN,NaN,NaN,NaN,NaN
6,107,Arjun,AI,1.0,74.0,NaN,NaN,NaN,NaN,NaN,NaN
7,108,Meena,DS,2.0,NaN,85.0,NaN,NaN,NaN,NaN,NaN
8,201,NaN,NaN,NaN,NaN,NaN,Laptop,Electronics,1.0,65000.0,10.0
9,202,NaN,NaN,NaN,NaN,NaN,Mouse,Accessories,2.0,800.0,5.0
10,203,NaN,NaN,NaN,NaN,NaN,Keyboard,Accessories,1.0,1500.0,0.0
11,204,NaN,NaN,NaN,NaN,NaN,Laptop,Electronics,1.0,70000.0,15.0
12,205,NaN,NaN,NaN,NaN,NaN,Monitor,Electronics,2.0,12000.0,NaN
13,206,NaN,NaN,NaN,NaN,NaN,Mouse,Accessories,3.0,850.0,5.0
14,207,NaN,NaN,NaN,NaN,NaN,Laptop,Electronics,1.0,68000.0,10.0
15,208,NaN,NaN,NaN,NaN,NaN,Keyboard,Accessories,2.0,1600.0,0.0

In [14]:
pd.merge(df1,df2,on='ID',how='right')

,ID,Name,Branch,Semester,Marks,Attendance (%),Product,Category,Quantity,Price,Discount (%)
0,201,NaN,NaN,NaN,NaN,NaN,Laptop,Electronics,1,65000,10.0
1,202,NaN,NaN,NaN,NaN,NaN,Mouse,Accessories,2,800,5.0
2,203,NaN,NaN,NaN,NaN,NaN,Keyboard,Accessories,1,1500,0.0
3,204,NaN,NaN,NaN,NaN,NaN,Laptop,Electronics,1,70000,15.0
4,205,NaN,NaN,NaN,NaN,NaN,Monitor,Electronics,2,12000,NaN
5,206,NaN,NaN,NaN,NaN,NaN,Mouse,Accessories,3,850,5.0
6,207,NaN,NaN,NaN,NaN,NaN,Laptop,Electronics,1,68000,10.0
7,208,NaN,NaN,NaN,NaN,NaN,Keyboard,Accessories,2,1600,0.0

In [15]:
pd.merge(df1,df2,on='ID',how='left')

,ID,Name,Branch,Semester,Marks,Attendance (%),Product,Category,Quantity,Price,Discount (%)
0,101,Amit,AI,1,78.0,90.0,NaN,NaN,NaN,NaN,NaN
1,102,Neha,DS,1,85.0,95.0,NaN,NaN,NaN,NaN,NaN
2,103,Ravi,AI,2,NaN,88.0,NaN,NaN,NaN,NaN,NaN
3,104,Pooja,CS,2,92.0,98.0,NaN,NaN,NaN,NaN,NaN
4,105,Kiran,DS,1,66.0,75.0,NaN,NaN,NaN,NaN,NaN
5,106,Sneha,CS,2,88.0,92.0,NaN,NaN,NaN,NaN,NaN
6,107,Arjun,AI,1,74.0,NaN,NaN,NaN,NaN,NaN,NaN
7,108,Meena,DS,2,NaN,85.0,NaN,NaN,NaN,NaN,NaN

# Joining Data

In [ ]:
# Data set for the joining 
employees = pd.DataFrame({
    'emp_id': [1, 2, 3],
    'name': ['A', 'B', 'C']
})

salaries = pd.DataFrame({
    'emp_id': [1, 2, 4],
    'salary': [50000, 60000, 70000]
})

In [ ]:
# Types of joining
pd.merge(employees, salaries, on='emp_id', how='inner')

   emp_id name  salary
0       1    A   50000
1       2    B   60000

In [5]:
pd.merge(employees, salaries, on='emp_id', how='outer')

   emp_id name   salary
0       1    A  50000.0
1       2    B  60000.0
2       3    C      NaN
3       4  NaN  70000.0

In [6]:
pd.merge(employees, salaries, on='emp_id', how='left')

   emp_id name   salary
0       1    A  50000.0
1       2    B  60000.0
2       3    C      NaN

In [13]:
pd.merge(employees, salaries, on='emp_id', how='right')

   emp_id name  salary
0       1    A   50000
1       2    B   60000
2       4  NaN   70000